{
  "translation": {
    "webTitile": "Personal Web",
    "headerAbout": "About",
    "headerTimeline": "Timeline",
    "headerPortfolio": "Portfolio",
    "aboutMe": "About Me",
    "Iam": "I am Chao Chi (Jeff)",
    "nowAs": "Now as a Full Stack Developer",
    "aboutDes": "I graduated with a degree in Materials Science and have a strong passion for board games. In early 2023, while creating a dice simulator for D&D, I discovered my passion for software development. This discovery inspired me to change my career path, investing significant time in self-learning programming, ultimately succeeding in transitioning to become a software engineer.",
    "photoDes": "This is what I usually like",
    "currentResponsibilities": "Current Responsibilities",
    "currentDes1": "Currently working as a Full Stack Engineer in manufacturing, developing",
    "currentDes2": " MES (Manufacturing Execution System) ",
    "currentDes3": "applications. Using C# .NET Framework and MVC architecture, I handle the complete development process from database design, backend API development to frontend interface implementation. Main projects include supplier measurement systems, parameter management systems, SPC data ETL processing, and currently developing an NFC-based patrol attendance system.",
    "currentDesEnd": "In this role, I've not only enhanced my full-stack development capabilities but also accumulated practical experience in handling production line issues, system deployment.",
    "timeline": "Timeline",
    "2023.01": "Starting Point: Began learning programming to create a dice simulator for D&D board games, discovering my passion for software development.",
    "2023.04": "Started systematic learning of frontend technologies: HTML, CSS, and JavaScript fundamentals.",
    "2023.06": "Deep dive into React.js framework, implementing multiple practice projects to familiarize with modern frontend development workflow.",
    "2023.08": "Career Transition Success! First software engineer position - Frontend Engineer for factory internal systems. Developed HR management system attendance interface, dispatch system, and business data management interface. Used React with frontend-backend separation architecture.",
    "2024.01": "Continuous Self-Learning: Explored Unity game development, attempted to create an RPG game. Though not completed, gained understanding of game development processes.",
    "2024.03": "Started learning backend technologies: C# language, WebSocket real-time communication, and backend service development, preparing to become a full-stack engineer.",
    "2024.07": "Joined current company as Full Stack Engineer, primarily developing MES systems with C#. Responsible for measurement data collection pages and supplier-specific systems as core functional modules.",
    "2024.09": "Skill Expansion: Independently completed MVC website setup and IIS deployment, handled security protection (XSS, SQL Injection prevention, etc.), and began taking full responsibility for supplier external system development.",
    "2025.01": "Present: Developing NFC-based patrol attendance system, integrating mobile NFC sensing with backend systems. Continuously learning TypeScript and Next.js to enhance frontend development skills.",
    "aboutnow-1": "In just 1.5 years as a software engineer, I've rapidly grown from zero foundation to a capable full-stack engineer. My current role has given me complete system development experience: from requirement gathering, database design, API development, frontend implementation, to system deployment and maintenance.",
    "aboutnow-2": "Given the rapid rise of AI, I constantly reflect on future tech trends. I am actively self-studying AI and Computer Vision (CV) to stay competitive and keep pace with the industry.",
    "protfolio": "Portfolio",
    "project01": "Personal Notebook",
    "project01des1": "A project inspired by Notion and Trello, intended to display notes as a blog in the future. This project is built using TypeScript and Next.js. Authentication is implemented with NextAuth, supporting email verification and two-factor authentication. The Notion-like part uses the BlockNote component to mimic native Notion operations, while the Trello-like part allows the creation of multiple boards. Each board functions as an independent to-do list where cards or lists can be reordered by drag-and-drop.",
    "project02": "Boardgame Support Recorder",
    "project02des1": "This this for helping me to record boardgame state, using signalR (websocket) on azure, more displays and presentations are available in the Notion link below.",
    "project03": "API for Accounting Functions",
    "project03des1": "Implemented API functionality using .NET. Currently, it supports authentication, API versioning, Docker deployment, and Azure deployment.",
    "project04": "WPF Data Storage",
    "project04des1": "This data storage feature is built using .NET. It mainly includes a master list and sub-items, both of which can be added, deleted, and modified. The sub-items can store images and directly copy the images into the project's directory.",
    "project05": "Mobile App Interface Showcase",
    "project05des1": "A project requested by a company, only required to demonstrate the mobile interface and sliding smoothness. Although it has no functionality, it is still showcased. *Note: This project does not have responsive design and looks proper only on mobile devices.*",
    "loadingWeatherAPI": "Loading...",
    "weathertitle": "Not-So-Useful Meteorological Bureau 36-Hour Temperature",
    "biography": "Biography",
    "headerBiography": "Biography",
    "jobRequirements": "Job Requirements",
    "desiredPosition": "Desired Position",
    "desiredPositionValue": "Full Stack Engineer, Backend Engineer, Frontend Engineer",
    "desiredIndustry": "Desired Industry",
    "desiredIndustryValue": "Computer Software Services, Semiconductor Manufacturing, Optoelectronics",
    "expectedSalary": "Expected Salary",
    "expectedSalaryValue": "面談",
    "availableDate": "Available Date",
    "availableDateValue": "面談",
    "education": "Education",
    "educationPhD": "National Taiwan University of Science and Technology | Materials Science and Engineering, PhD",
    "educationPhDPeriod": "Aug 2014 – Jan 2019",
    "educationMaster": "National Taiwan University of Science and Technology | Materials Science and Engineering, M.S.",
    "educationMasterPeriod": "Mar 2013 – Aug 2014",
    "educationBachelor": "National Taiwan University of Science and Technology | Materials Science and Engineering, B.S.",
    "educationBachelorPeriod": "Sep 2009 – Feb 2013",
    "autobiography": "Autobiography",
    "autobiographyP1": "My career began with research training in materials science, cultivating rigorous systematic thinking, data analysis capabilities, and complex problem-solving logic. These abilities enabled me to quickly absorb new technologies and build stable, maintainable system architectures after transitioning to software engineering.",
    "autobiographyP2": "Since 2023, I started with React.js for frontend development, becoming familiar with modern web development processes. In 2024, I transitioned to CIM Software Engineer, expanding my tech stack to C# .NET Framework full-stack development, responsible for multiple key MES/CIM systems in the semiconductor manufacturing industry.",
    "autobiographyP3": "I focus on 'process digitization' and 'quantifiable value', such as:",
    "autobiographyAchievement1": "Self-built systems replacing purchased software (injection measurement, SCM, inspection), saving annual maintenance costs",
    "autobiographyAchievement2": "Established ETL/data intermediate layer, and various in-plant data transfer and scheduled computation processes, stably supplying quality data required for SPC monitoring",
    "autobiographyAchievement3": "Promoted standardized operations for Parameter Management System (RMS), replacing outsourced systems",
    "autobiographyP4": "\"Chase excellence, success will follow.\" — 3 Idiots",
    "workExperience": "Work Experience",
    "job1Title": "Software Engineer | CIM / MES Systems",
    "job1Period": "Jul 2024 – Present",
    "job1Company": "Semiconductor Manufacturing (500+ employees)",
    "techStack": "Tech Stack",
    "job1TechStack": "C# .NET Framework (MVC / WebAPI), SQL Server, JavaScript, Git",
    "role": "Role",
    "job1Role": "Lead MES/CIM system planning, backend development, data flow integration",
    "job1Project1Title": "Injection Molding Measurement Module",
    "job1Project1Detail1": "Designed data tables, user interface, quality inspection logic",
    "job1Project1Detail2": "Replaced purchased system, saving NT$200,000 annually",
    "job1Project1Detail3": "Supporting all factory injection molding operators",
    "job1Project2Title": "Supplier SCM Platform",
    "job1Project2Detail1": "Multi-vendor data isolation, shipping/measurement process, permissions and tracking",
    "job1Project2Detail2": "Solved security issues, discontinued purchased system, supporting all suppliers",
    "job1Project3Title": "Parameter Management System (RMS)",
    "job1Project3Detail1": "Centralized parameter management, machine synchronization, exception alerts",
    "job1Project3Detail2": "Combined with performance calculations, saving NT$600,000 in annual maintenance fees",
    "job1Project4Title": "Inspection System (NFC / Edge Computer)",
    "job1Project4Detail1": "NFC checkpoint scanning, inspection process optimization, established new personnel activity dashboard for factory",
    "job1Project4Detail2": "Proposed personnel operation optimization plans from reports",
    "job1Project5Title": "ETL Scheduling and SPC Integration",
    "job1Project5Detail1": "Built C# ETL, providing quality data intermediate layer",
    "job1Project5Detail2": "Improved data timeliness and accuracy, supporting process monitoring",
    "job2Title": "Frontend Engineer | Internal Systems Development",
    "job2Period": "Aug 2023 – Apr 2024",
    "job2Company": "Optoelectronics Industry (30-100 employees)",
    "job2TechStack": "React.js, JavaScript (ES6+), HTML5, CSS3, Git",
    "job2ProjectTitle": "Led Internal Systems (Dispatch, Time Attendance, HRM)",
    "job2ProjectDetail1": "Adopted component-based, state management, maintainable architecture",
    "job2ProjectDetail2": "Service reduced administrative manual statistics costs",
    "coreSkills": "Core Skills",
    "backendFullStack": "Backend / Full Stack",
    "skillBackend1": "C# .NET Framework (MVC / WebAPI)",
    "skillBackend2": "SQL Server",
    "skillBackend3": "ETL scheduling design, data intermediate layer implementation",
    "frontend": "Frontend",
    "skillFrontend1": "React.js, JavaScript (ES6+)",
    "skillFrontend2": "HTML5 / CSS3",
    "manufacturingIntegration": "Manufacturing System Integration",
    "skillManufacturing1": "MES / CIM",
    "skillManufacturing2": "SPC Integration",
    "skillManufacturing3": "Intermediate Database Design",
    "engineeringPractice": "Engineering Practice",
    "skillEngineering1": "Git / Git Flow",
    "skillEngineering2": "System Architecture, Requirements Analysis",
    "skillEngineering3": "Cross-departmental Collaboration, Basic Security Concepts",
    "continuousLearning": "Continuous Learning",
    "skillLearning": "TypeScript, Next.js, AWS, AI Engineering"
  }
}